/* MenuView */
"menu.latency" = "Latency:";
"menu.latency.ms" = "ms";
"menu.launch_at_startup" = "Launch at Startup";
"menu.settings" = "Settings...";
"menu.quit" = "Quit";

/* PreferencesView - Tabs */
"preferences.tab.general" = "General";
"preferences.tab.about" = "About";

/* PreferencesView - General */
"preferences.general.target_host" = "Target Host:";
"preferences.general.target_host.placeholder" = "e.g., www.google.com";
"preferences.general.update_interval" = "Update Interval:";
"preferences.general.update_interval.unit" = "second(s)";

/* PreferencesView - About */
"preferences.about.app_name" = "MenuPing";
"preferences.about.version" = "Version 1.0.0";
"preferences.about.description" = "Monitor your internet connection latency";
"preferences.about.license" = "Licensed under MIT";
"preferences.about.copyright" = "© 2025 Julien Bordet";
"preferences.about.acknowledgements" = "Acknowledgements";
"preferences.about.visit_website" = "Visit Website";
"preferences.about.send_feedback" = "Send Feedback";

